# CannotPlaceFabricAreaWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..CannotPlaceFabricAreaWarn Property
BuiltInFailures..::..FabricFailures Class See Also
---
Can't find a host for Fabric Area.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceFabricAreaWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceFabricAreaWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceFabricAreaWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace